/******************************** Первое задание***********************************/







/******************************** Второе задание***********************************/

/*
let name = ' Айжан';
alert('Привет,' + name);
*/

/******************************** Третье задание***********************************/

/*
let age = ' 27';
alert('Мне' + age + 'лет!');
*/

/******************************** Четвертое задание***********************************/

let a = 17;
let b = 10;
let c = a - b;
console.log(c);
let d = 7;
let result = c + d;
console.log(result)

/******************************** Пятое задание***********************************/

let num = 47;
